/*Задача №2 - Типы данных
Создание переменных:
Создайте переменную типа с плавающей точкой с наибольшим диапазоном чисел. Присвойте ей произвольное дробное значение.
Создайте переменную целочисленного типа с наименьшим диапазоном чисел. Присвойте  ей наибольшее возможное значение.
*/

public class TaskWork02 {
    public static void main(String[] args) {
        double a = 9999921321546546849865543545321111311111111213132168010101210468454.5478777887878421213000646;
        byte b = 127;

        System.out.println(a);
        System.out.println(b);
    }
}